In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import os
%matplotlib inline

In [19]:
df_2020 = pd.read_csv("./Resources/project1_account_apprl_year_2020.csv")
df_2020.head()

,ACCOUNT_NUM,APPRAISAL_YR,TOT_VAL,PREV_MKT_VAL,CITY_JURIS_DESC,COUNTY_JURIS_DESC,ISD_JURIS_DESC,CITY_TAXABLE_VAL,APPRAISAL_METH_CD,DIVISION_CD,BLDG_CLASS_CD
0,794000000000,2020,823360,750000.0,DALLAS,DALLAS COUNTY,RICHARDSON ISD,823360,3,COM,RETAIL STRIP
1,102000000000,2020,384280,512040.0,DALLAS,DALLAS COUNTY,DALLAS ISD,384280,1,COM,STORAGE WAREHOUSE
2,103000000000,2020,1619550,1403610.0,DALLAS,DALLAS COUNTY,DALLAS ISD,0,1,COM,LAND ONLY
3,103000000000,2020,413820,326700.0,DALLAS,DALLAS COUNTY,DALLAS ISD,413820,1,COM,LAND ONLY
4,104000000000,2020,455400,370000.0,DALLAS,DALLAS COUNTY,DALLAS ISD,455400,3,COM,OFFICE/SHOWROOM

In [8]:
df_2020.dtypes

ACCOUNT_NUM           object
APPRAISAL_YR           int64
TOT_VAL                int64
PREV_MKT_VAL         float64
CITY_JURIS_DESC       object
COUNTY_JURIS_DESC     object
ISD_JURIS_DESC        object
CITY_TAXABLE_VAL       int64
APPRAISAL_METH_CD      int64
DIVISION_CD           object
BLDG_CLASS_CD         object
dtype: object

In [9]:
df_2020.shape

(840036, 11)

In [10]:
df_acct_info = pd.read_csv("./Resources/project1_account_info.csv")
df_acct_info.head()

,ACCOUNT_NUM,STREET_NUM,FULL_STREET_NAME,BLDG_ID,UNIT_ID,PROPERTY_CITY,PROPERTY_ZIPCODE
0,125584000000,4803,VICTOR ST,NaN,NaN,DALLAS,752461141.0
1,125680000000,4616,VICTOR ST,NaN,NaN,DALLAS,752461157.0
2,125731000000,4300,WORTH ST,NaN,NaN,DALLAS,752461301.0
3,132184000000,2518,S ERVAY ST,NaN,NaN,DALLAS,752152603.0
4,128110000000,3212,GUNTER AVE,NaN,NaN,DALLAS,752102330.0

In [15]:
df_acct_info.dtypes

ACCOUNT_NUM          object
STREET_NUM            int64
FULL_STREET_NAME     object
BLDG_ID              object
UNIT_ID              object
PROPERTY_CITY        object
PROPERTY_ZIPCODE    float64
dtype: object

In [16]:
df_acct_info.shape

(840036, 7)

In [13]:
df_res_detail = pd.read_csv("./Resources/project1_res_detail.csv")
df_res_detail.head()

,ACCOUNT_NUM,ACT_AGE,TOT_LIVING_AREA_SF,NUM_FULL_BATHS,NUM_HALF_BATHS,NUM_BEDROOMS
0,245000000000,68,1628,1,1,3
1,245000000000,72,1965,2,0,3
2,245000000000,72,2519,3,0,3
3,245000000000,68,2112,2,0,3
4,245000000000,69,1272,1,0,2

In [17]:
df_res_detail.dtypes

ACCOUNT_NUM           object
ACT_AGE                int64
TOT_LIVING_AREA_SF     int64
NUM_FULL_BATHS         int64
NUM_HALF_BATHS         int64
NUM_BEDROOMS           int64
dtype: object

In [18]:
df_res_detail.shape

(660941, 6)